#+TITLE: 一些琐碎而不成文的知识点

Go的语法可以看作C++的子集, 但Go加上了GC和Interface, 从而从系统编程的角度更加方便

* Slice迷思

  slice也是按值传递，和其他元素并无不同， 理解了这一点， 就没有什么迷思了， 它的结构如下：

  #+BEGIN_SRC go
	type slice struct {
		ptr *Elem
		len int
		cap int
	}
  #+END_SRC

  所以需要进行append, slice等操作时，都需要对slice按指针传递

  #+BEGIN_SRC go :exports both
	package main

	import "fmt"

	func main() {
		slice := []int{2, 4, 1, 5, 3}
		newSlice := slice[3:4]
		newSlice = append(newSlice, 6)
		fmt.Println(newSlice)
		fmt.Println(slice)
	}
  #+END_SRC

  #+RESULTS:
  : [5 6]
  : [2 4 1 5 6]
  
  
** Type Assertion
   type assertion形式如下：

   #+BEGIN_EXAMPLE
   t, ok := <interface value>.(<type>)
   #+END_EXAMPLE

   即type assertion的参数一定是用于interface value的，并且type可以是struct type，也可以interface type; 如果type assertion成功，则返回值t就是对应的concret value或者interface value(取决于type assertion的type参数)

   #+BEGIN_SRC go
	package main

	import "fmt"
	import "reflect"	

	func main() {
		var a interface{} = "hello"
		t, ok := a.(string)
		if ok {
			fmt.Println(reflect.TypeOf(t))
		}
		x, ok := a.(interface{})		
		if x == t {
			fmt.Println(reflect.TypeOf(x))
		}
	}
   #+END_SRC

   #+RESULTS:
   : string
   : hello
  
  
   为什么需要type assertion, 其一是可以判定interface value的具体类型或是否满足某个接口，且二它也golang的优化有关cite:cox09


** Type Switch
   
   type switch 如下，它和type assertion类似，都只针对interface value，在面向接口编程时，可以根据interface value的具体类型或者接口从而进行不同操作，
   最经典的就是fmt.Println(), 它接受的参数是interface{}, 然后在内部根据具体类型执行相应操作
   
   #+BEGIN_SRC go
	 package main

	 import "fmt"

	 func main() {
		 var s interface{} = "sdas"
		 switch v := s.(type) {
		 case interface{}:
			 fmt.Println("interface{}")
		 case string:
			 fmt.Println(v)
		 default:
			 fmt.Println("default")
		 }	
	 }
   #+END_SRC

   #+RESULTS:
   : interface{}


* struct{}可以用来干什么

  - 实现HashSet
  - 不发送数据的信道，只用来close，例如done
  - 尽包含方法的结构体

	
  实现HashSet
  
  #+BEGIN_SRC go
	package main

	import "fmt"

	func main() {
	st := make(map[int]struct{})
		st[1] = struct{}{}
		st[2] = struct{}{}
		if _, ok := st[3]; ok {
			fmt.Println("3 is in st")
		} else {
			fmt.Println("3 is not in st")
		}
		if _, ok := st[2]; ok {
			fmt.Println("2 is in st")		
		} else {
			fmt.Println("2 is not in st")
		}
	}
  #+END_SRC

  #+RESULTS:
  : 3 is not in st
  : 2 is in st


